Revit 2024 API
Viewport.SheetId Property
 The element id of the ViewSheet on which the viewport appears, or InvalidElementId if this viewport does not associate a view with placement onto a sheet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ElementId SheetId { get; }
Visual Basic
Public ReadOnly Property SheetId As ElementId
	Get
Visual C++
public:
property ElementId^ SheetId {
	ElementId^ get ();
}
See Also
Viewport Class
Autodesk.Revit.DB Namespace